/*
 * Лабораторная работа №1
 * Студент: Багаутдинова Диана (номер: 3)
 * Вариант: 3
 * Задание: 18 (Сумма первых n натуральных чисел)
 */

#include <stdio.h>

int main(void) {
    int n, sum = 0;
    
    printf("Введите натуральное число: ");
    if (scanf("%d", &n) != 1 || n <= 0) {
        printf("Ошибка! Нужно положительное число.\n");
        return 1;
    }
    
    for (int i = 1; i <= n; i++) {
        sum += i;
    }
    
    printf("Сумма 1 + 2 + ... + %d = %d\n", n, sum);
    return 0;
}