/*
 * Лабораторная работа №1
 * Студент: Багаутдинова Диана (номер: 3)
 * Вариант: 4
 * Задание: 4 (Факториал числа)
 */

#include <stdio.h>

int main(void) {
    int n;
    long long factorial = 1; // Используем long long, так как факториал быстро растет

    printf("Задание 4. Вычисление факториала числа.\n");
    printf("Введите неотрицательное целое число n: ");

    // Проверка корректности ввода (пользователь ввел именно число)
    if (scanf("%d", &n) != 1) {
        printf("Ошибка: необходимо ввести целое число.\n");
        return 1;
    }

    // Проверка на отрицательное число
    if (n < 0) {
        printf("Ошибка: факториал для отрицательного числа не определен.\n");
        return 1;
    }

    // Вычисление факториала с помощью цикла
    for (int i = 1; i <= n; i++) {
        factorial *= i;
    }

    printf("%d! = %lld\n", n, factorial);

    return 0;
}