/*
Лабораторная работа №1
Студент: Загеева Ксения (номер: 12)
Вариант: 12
Задание: 27 (Сумма элементов каждого столбца матрицы)
*/

#include <stdio.h> // для printf и scanf

#define MAX_ROWS 10   // максимальное количество строк
#define MAX_COLS 10   // максимальное количество столбцов

int main(void) {
    int rows, cols;
    int matrix[MAX_ROWS][MAX_COLS];
    char term; // для проверки конца ввода
    char buffer[100]; // для записи считываемой строки 

    printf("Введите количество строк (1-%d): ", MAX_ROWS); // форматная строка и аргументы; %d — форматный спецификатор, вместо него подставится MAX_ROWS
    if (!fgets(buffer, sizeof(buffer), stdin)) {
        // fgets - считывает всю строку
        // buffer - куда будет записана считанная строк
        // sizeof(buffer) - максимальное количество символов для считывания
        // stdin - поток, из которого читаем - стандартный ввод (клавиатура)
        printf("Ошибка ввода: ввели фигню\n");
        return 1;
    }
    if (sscanf(buffer, "%d%c", &rows, &term) != 2 || term != '\n' || rows < 1 || rows > MAX_ROWS) { 
        // sscanf считывает данные из строки buffer, а не напрямую из консоли
        // % — начало спецификатора, d — целое число, %c — следующий символ и он пойдет в term
        // != 2 - целое число и следующий символ(по хорошему \n)
        // "term != '\n'" - если после числа любой другой символ, а не enter, то ошибка 
        printf("Ошибка: неверное количество строк, посмотрите ограничения внимательнее\n");
        return 1;
    }

    printf("Введите количество столбцов (1-%d): ", MAX_COLS);
    if (!fgets(buffer, sizeof(buffer), stdin)) {
        printf("Ошибка ввода: ввели фигню\n");
        return 1;
    }
    if (sscanf(buffer, "%d%c", &cols, &term) != 2 || term != '\n' || cols < 1 || cols > MAX_COLS) {
        printf("Ошибка: неверное количество столбцов, посмотрите ограничения внимательнее\n");
        return 1;
    }

    // Ввод элементов матрицы
    for (int i = 0; i < rows; i++) {
        for (int j = 0; j < cols; j++) {
            printf("Введите элемент [%d][%d]: ", i + 1, j + 1);
            if (!fgets(buffer, sizeof(buffer), stdin)) {  // считываем строку
                printf("Ошибка ввода: ввели фигню\n");
                return 1;
            }
            // проверяем, что введено одно число
            if (sscanf(buffer, "%d %c", &matrix[i][j], &term) != 1) {
                printf("Ошибка: некорректный ввод, введите целое число\n");
                return 1;
            }
        }
    }

    // Вычисление и вывод суммы каждого столбца
    printf("\nСумма элементов каждого столбца:\n");
    for (int j = 0; j < cols; j++) {
        int sum = 0;
        for (int i = 0; i < rows; i++) {
            sum += matrix[i][j];
        }
        printf("Столбец %d: %d\n", j + 1, sum);
    }

    return 0;
}

/* тестирование:
1. меньше 1
Введите количество строк (1-10): 0
Ошибка: неверное количество строк, посмотрите ограничения внимательнее
Введите количество строк (1-10): -1
Ошибка: неверное количество строк, посмотрите ограничения внимательнее
2. больше 10
Введите количество строк (1-10): 11
Ошибка: неверное количество строк, посмотрите ограничения внимательнее
3. строка
Введите количество строк (1-10): qwerrty
Ошибка: неверное количество строк, посмотрите ограничения внимательнее
4. число+строка
Введите количество строк (1-10): 1q
Ошибка: неверное количество строк, посмотрите ограничения внимательнее
5. набор чисел 
Введите количество строк (1-10): 1 1 1
Ошибка: неверное количество строк, посмотрите ограничения внимательнее
6. норм числа
Введите количество строк (1-10): 3
Введите количество столбцов (1-10): 3
Введите элемент [1][1]: 1
Введите элемент [1][2]: 2
Введите элемент [1][3]: 3
Введите элемент [2][1]: 1
Введите элемент [2][2]: 2
Введите элемент [2][3]: 3
Введите элемент [3][1]: 1
Введите элемент [3][2]: 2
Введите элемент [3][3]: 3
Сумма элементов каждого столбца:
Столбец 1: 3
Столбец 2: 6
Столбец 3: 9
7. граничные значения
Введите количество строк (1-10): 1
Введите количество столбцов (1-10): 1
Введите количество строк (1-10): 10
Введите количество столбцов (1-10): 10
8. пустая строка
Введите количество строк (1-10): 
Ошибка: неверное количество строк, посмотрите ограничения внимательнее
9. строка из пробелов
Введите количество строк (1-10):                    
Ошибка: неверное количество строк, посмотрите ограничения внимательнее
10. дробные 
Введите количество строк (1-10): 4.5
Ошибка: неверное количество строк, посмотрите ограничения внимательнее
*/