/*
 * Лабораторная работа №1
 * Студент: Загеева Ксения (номер: 12)
 * Вариант: 13
 * Задание: 13 (Сумма цифр числа)
 */

#include <stdio.h> // для printf и scanf
#include <ctype.h> // для isspace (проверять пробелы, табуляции, переводы строк)

int main(void) {
    int number;
    int sum = 0;
    char buffer[100]; // массив символов (строка), для введённого пользователем текста

    printf("Введите целое число: ");

    if (!fgets(buffer, sizeof(buffer), stdin)) {
        // fgets - считывает всю строку 
        // buffer - куда будет записана считанная строк
        // sizeof(buffer) - максимальное количество символов можно считать
        // stdin - поток, из которого читаем - стандартный ввод (клавиатура)
        printf("Ошибка ввода: ввод не получен\n");
        return 1;
    }

    // пустая строка
    int only_spaces = 1; // флаг
    for (size_t i = 0; buffer[i] != '\n'; i++) { // цикл работает, пока текущий символ не равен символу перевода строки \n
        if (!isspace((unsigned char)buffer[i])) { // если есть норм символ не пробелы всякие 
            only_spaces = 0;
            break;
        }
    }
    if (only_spaces) {
        printf("Ошибка: пустой ввод\n");
        return 1;
    }

    // в введеной строке только число 
    char extra;
    if (sscanf(buffer, " %d %c", &number, &extra) != 1) {
        // sscanf считывает целое число (%d) и записывает в number 
        // и один дополнительный символ (%c) и записывает в extra (проверяет, есть ли лишние символы после числа)
        // если вернет не 1, а 2, значит после числа есть лишние символы 
        printf("Ошибка: некорректный ввод, введите одно целое число\n");
        return 1;
    }

    if (number < 0) {
        printf("Ошибка: число должно быть неотрицательным\n");
        return 1;
    }

    if (number == 0) {
        printf("Сумма цифр числа 0 равна 0\n");
        return 0;
    }

    // сумма цифр числа
    int temp = number;
    while (temp > 0) {
        sum += temp % 10;
        temp /= 10;
    }

    printf("Сумма цифр числа %d равна %d\n", number, sum); // %d — для целых чисел

    return 0;
}

/* Тесты:
1. положительное
Введите целое число: 123
Сумма цифр числа 123 равна 6
2. 0
Введите целое число: 0  
Сумма цифр числа 0 равна 0
3. отрицательное
Введите целое число: -123
Ошибка: число должно быть неотрицательным
4. строка 
Введите целое число: qwerty
Ошибка: некорректный ввод, введите одно целое число
5. число+строка
Введите целое число: 1q
Ошибка: некорректный ввод, введите одно целое число
6. набор чисел 
Введите целое число: 1 1 1
Ошибка: некорректный ввод, введите одно целое число
7. пустая строка
Введите целое число: 
Ошибка: пустой ввод
8. строка из пробелов
Введите целое число:               
Ошибка: пустой ввод
9. дробные
Введите целое число: 4,5
Ошибка: некорректный ввод, введите одно целое число
*/