/*
 * Лабораторная работа №1
 * Студент: Багаутдинова Диана (номер: 3)
 * Вариант: 4
 * Задание: 19 (Вычисление значения функции y = x² + 2x + 1)
 */

#include <stdio.h>

int main(void) {
    double x, y;

    printf("Задание 19. Вычисление значения функции y = x^2 + 2x + 1.\n");
    printf("Введите значение x: ");

    // Проверка корректности ввода (можно вводить и целые, и дробные числа)
    if (scanf("%lf", &x) != 1) {
        printf("Ошибка: необходимо ввести число.\n");
        return 1;
    }

    // Вычисление значения функции
    y = x * x + 2 * x + 1;

    printf("Для x = %.2f, значение y = %.2f\n", x, y);

    return 0;
}