   /*
    * Лабораторная работа №1
    * Студент: Котова Алиса (номер: 19)
    * Вариант: 19
    * Задание: 4 (Факториал числа)
    */


#include <stdio.h>      // Библиотека для ввода и вывода (printf, scanf)
#include <limits.h>     // Хранит максимальное значение для разных типов чисел
#include <windows.h>    // Нужна для настройки кодировки консоли в Windows

#define MIN_FACTORIAL_INPUT 0   // Минимальное число, для которого можно считать факториал

// Функция считает факториал числа
// number — число, которое ввёл пользователь
// result — место, куда мы запишем результат
int calculate_factorial(int number, unsigned long long *result) {

    // Переменная, где будем постепенно накапливать факториал
    unsigned long long factorial = 1;

    // Цикл проходит по всем числам от 1 до number
    for (int i = 1; i <= number; i++) {

        // Проверяем, не будет ли переполнения числа
        // ULLONG_MAX — максимально возможное значение типа unsigned long long
        if (factorial > ULLONG_MAX / i) {
            return 0;   // Если число станет слишком большим — сообщаем об ошибке
        }

        // Умножаем текущее значение факториала на i
        factorial = factorial * i;
    }

    // Сохраняем результат в переменную из main
    *result = factorial;

    return 1; // Сообщаем, что всё прошло успешно
}

int main(void) {

    // Эти две строки делают так, чтобы русский текст нормально показывался в консоли Windows
    SetConsoleOutputCP(CP_UTF8);
    SetConsoleCP(CP_UTF8);

    int input_number;                     // Здесь будет храниться число пользователя
    unsigned long long factorial_result;  // Здесь будет храниться результат факториала

    // Просим пользователя ввести число
    printf("Введите неотрицательное целое число: ");

    // Считываем число
    // scanf возвращает количество успешно считанных значений
    if (scanf("%d", &input_number) != 1) {
        printf("Ошибка: вы ввели не число.\n");
        return 1; // Завершаем программу с ошибкой
    }

    // Проверяем, что число не отрицательное
    if (input_number < MIN_FACTORIAL_INPUT) {
        printf("Ошибка: факториал нельзя считать для отрицательных чисел.\n");
        return 1;
    }

    // Вызываем функцию вычисления факториала
    // Если она вернула 0 — значит число получилось слишком большим
    if (!calculate_factorial(input_number, &factorial_result)) {
        printf("Ошибка: число слишком большое.\n");
        return 1;
    }

    // Выводим результат
    printf("Факториал числа %d равен %llu\n", input_number, factorial_result);

    return 0; // Программа завершилась успешно
}