/*
Лабораторная работа №2
Студент: Каюмов Альберт (номер: 17)
Вариант: 17
Задание: 18. Сумма первых n натуральных чисел
Количество предупреждений: 15 (из них 6 -Wextra) */

// 18. Сумма первых n натуральных чисел

#include <stdio.h>

// Предупреждение 1: Неиспользуемый параметр функции
void unusedParameter(int x) {
    // Параметр x не используется
}

// Предупреждение 2: Функция без прототипа
oldStyleFunction(a, b)
int a, b;
{
    return a + b;
}

// Предупреждение 3: Нет возвращаемого значения в не-void функции
int noReturnValue() {
    int x = 10;
    // Нет return
}

// Предупреждение 4: Неиспользуемая переменная
int main() {
    int number;
    int sum = 0;
    int unusedVariable;  // Не используется
    
    // Предупреждение 5: Неинициализированная переменная
    int uninitializedVar;
    
    // Предупреждение 6: Сравнение знакового и беззнакового
    unsigned int unsignedNum = 5;
    
    // Предупреждение 7: Присваивание в условии
    printf("Введите натуральное число: ");
    if (scanf("%d", &number) = 1) {  // Должно быть ==, а не =
        printf("Ошибка! Нужно ввести натуральное число.\n");
        return 1;
    }
    
    // Предупреждение 8: Сравнение с самим собой
    if (number == number) {
        printf("Это бессмысленное сравнение\n");
    }
    
    // Предупреждение 9: Пустое тело if
    if (number <= 0);
    {
        printf("Ошибка! Нужно ввести натуральное число.\n");
        return 1;
    }
    
    // Предупреждение 10: Использование = вместо == в условии цикла
    for (int num = 1; num = number; num++) {  // Должно быть <= или <
        sum = num + sum;
    }
    
    // Предупреждение 11: Неиспользуемый результат функции
    printf("Сумма первых %d натуральных чисел: %d\n", number, sum);
    uninitializedVar;  // Использование неинициализированной переменной
    
    // Предупреждение 12: Неявное объявление функции
    implicitFunctionCall();  // Функция не объявлена
    
    // Предупреждение 13: Неправильное использование спецификаторов формата
    printf("Число: %s\n", number);  // %s для int
    
    // Предупреждение 14: Возврат значения из void функции
    return 0;
}

// Предупреждение 15: Определение функции после использования
void implicitFunctionCall() {
    printf("Эта функция объявлена после использования\n");
}