/*
Лабораторная работа №1
Студент: Загеева Ксения (номер: 12)
Вариант: 12
Задание: 12 (Проверка числа на палиндром в двоичной системе)
*/

#include <stdio.h> // для printf и scanf

#define MAX_BITS 32 // массив будет на 32 элемента (unsigned int обычно 4 байта)

int main(void) { // главная функция
    unsigned int number; // переменная для числа пользователя (unsigned значит число не может быть отрицательным)
    int binary[MAX_BITS]; // массив, куда мы будем записывать двоичные цифры
    int size = 0; // сколько двоичных цифр записалось
    char term; // для проверки конца ввода
    char buffer[100]; // для записи считываемой строки

    printf("Введите целое число: ");

    // cчитываем всю строку
    if (!fgets(buffer, sizeof(buffer), stdin)) {
        printf("Ошибка ввода: ввели фигню\n");
        return 1;
    }
    // проверяем, что введено одно целое число без лишних символов
    if (sscanf(buffer, "%d%c", &number, &term) != 2 || term != '\n') {
        // % — начало спецификатора, u — unsigned int (беззнаковое целое число)
        // & - оператор взятия адреса, 
        // scanf если норм записал - вернет количество успешно считанных значений
        printf("Ошибка: некорректный ввод, введите норм число\n");
        return 1;
    }

    if (number == 0) {
        printf("Смысл проверять 0, оно везде палиндром\n");
        return 0;
    }

    // перевод числа в 2 сс
    while (number > 0) {
        binary[size] = number % 2;
        number = number / 2;
        size++;
    }

    // проверка 
    for (int i = 0; i < size / 2; i++) {
        if (binary[i] != binary[size - 1 - i]) {
            printf("Число НЕ является палиндромом в двоичной системе.\n");
            return 0;
        }
    }

    printf("Число является палиндромом в двоичной системе.\n");

    return 0;
}

/* тестирование:
1. отрицательные
Введите целое число: -10
Число НЕ является палиндромом в двоичной системе.
2. 0
Введите целое число: 0
Смысл проверять 0, оно везде палиндром
3. положительные
Введите целое число: 5
Число является палиндромом в двоичной системе.
4. дробные
Введите целое число: 4,5
Ошибка: некорректный ввод, введите норм число
Введите целое число: 4.5
Ошибка: некорректный ввод, введите норм число
5. палиндромы (-1 = 11111111, -2147483647 = 100..001, 5 = 101, 127 = 1111111)
Введите целое число: -1
Число является палиндромом в двоичной системе.
Введите целое число: -2147483647
Число является палиндромом в двоичной системе.
Введите целое число: 5
Число является палиндромом в двоичной системе.
Введите целое число: 127
Число является палиндромом в двоичной системе.
6. не палиндромы 
Введите целое число: 10
Число НЕ является палиндромом в двоичной системе.
7. строка
Введите целое число: qwerty
Ошибка: некорректный ввод, введите норм число
8. число+строка
Введите целое число: 1q1
Ошибка: некорректный ввод, введите норм число
9. набор чисел 
Введите целое число: 1 1 1
Ошибка: некорректный ввод, введите норм число
10. пустая строка
Введите целое число: 
Ошибка: некорректный ввод, введите норм число
11. строка из пробелов
Введите целое число:                
Ошибка: некорректный ввод, введите норм число
*/